//Задача 1
//Программа выводящая максимальную цифру числа
// Console.Clear();
// int num = new Random().Next(10, 100);
// int a1 = num / 10;
// int a2 = num % 10;

// int max = a1;
// while (max < a2)
// {
//     max = a2;
// }

// Console.WriteLine("Максимальная цифра " + num + "->" + max);


//Задача 2
//Написать программу, которая выводит случайное трехзначное число и удаляет вторую цифру этого числа.
// int num = new Random().Next(100, 1000); //находим случайное число
// int b = num / 100; //вычисляем первое число
// int c = num % 10; //вычисляем последнее число

// int rec = b*10 +c; //умножаем первое число на 10 и плюсуем последнее

// Console.WriteLine(num + " " + rec);


//Задача 3
//Напишите программу, которая будет принимать на вход два числа и выводить, является ли второе число кратным первому. 
//если число 2 не кратно числу 1, то выводить остаток от деления

